//----------------------------------------------------------------
//  Напишите программу, 
// которая принимает на вход координаты точки (X и Y), 
// причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, 
// в которой находится эта точка.
//----------------------------------------------------------------
Console.Clear();

//----------------------------------------------------------------
// Console.Write("Введите координату по оси oX: ");
// int x = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите координату по оси oY: ");
// int y = Convert.ToInt32(Console.ReadLine());

// if (x > 0 && y > 0) Console.WriteLine($"Точка находится в первой четверти плоскости");
// else if (x < 0 && y > 0) Console.WriteLine($"Точка находится во второй четверти плоскости");
// else if (x < 0 && y < 0) Console.WriteLine($"Точка находится в третьей четверти плоскости");
// else if (x > 0 && y < 0) Console.WriteLine($"Точка находится в четвертой четверти плоскости");
// else if (x == 0 || y == 0) Console.WriteLine($"Обе координаты должны иметь значение не равное 0");
//----------------------------------------------------------------
// Напишите программу, которая по заданному номеру четверти, 
// показывает диапазон возможных координат точек в этой четверти (x и y).

//----------------------------------------------------------------
// Console.Write("Введите номер четверти: ");
// int quarter = Convert.ToInt32(Console.ReadLine());

// if (quarter == 1) Console.WriteLine($"I четверть: x > 0; y > 0");
// else if (quarter == 2) Console.WriteLine($"II четверть: x < 0; y > 0");
// else if (quarter == 3) Console.WriteLine($"III четверть: x < 0; y < 0");
// else if (quarter == 4) Console.WriteLine($"IV четверть: x > 0; y < 0");
// else Console.WriteLine($"Error: на плоскости 4 четверти, возможно совершили ошибку в введенных данных");


//----------------------------------------------------------------

// Math.Round (число, кол-во знаков после запятой)
// Math.Sqrt(число, от которого берется корень)
// Math.Pow(2,3); // 2 в 3 степени = 2*2*2 = 8

//----------------------------------------------------------------

// Задача 21: Напишите программу, которая принимает на вход координаты двух точек 
//и находит расстояние между ними в 2D пространстве.
// A (3,6); B (2,1) -> 5,09 
// A (7,-5); B (1,-1) -> 7,21

// sqrt((Xb - XA)^2 + (Yb - Ya)^2) 
//----------------------------------------------------------------

// Console.Write("Введите координату ox первой точки: ");
// int x1 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите координату oy первой точки: ");
// int y1 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите координату ox второй точки: ");
// int x2 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите координату oy второй точки: ");
// int y2 = Convert.ToInt32(Console.ReadLine());

// double result = Math.Sqrt(Math.Pow(x1 - x2, 2) + Math.Pow(y1 - y2, 2));
// Console.WriteLine($"result = {Math.Round(result, 2)}");
// Console.WriteLine($"Расстояние = {result:f2}");

//----------------------------------------------------------------


// Задача 22: Напишите программу, которая принимает на вход число (N) и выдаёт таблицу квадратов чисел от 1 до N.
// 5 -> 1, 4, 9, 16, 25.
// 2 -> 1,4

//----------------------------------------------------------------

Console.Write("Введите число N: ");
int number = Convert.ToInt32(Console.ReadLine());

if (number < 0) number = number * (-1);
//----------------------------------------------------------------

// int i = 1;
// while (i <= number)
// {
//     double result = Math.Pow(i,2);
//     Console.Write($" {result}");
//     i++;
// }
//----------------------------------------------------------------

for (int i = 1; i <= number; i++)
{
    double result = Math.Pow(i,2);
    Console.Write($"{result} ");
    
}
//----------------------------------------------------------------
